["香港", "西藏自治区那曲市", "香港香港", "台湾省台南市", "台湾省高雄市", "台湾省台中市", "台湾省台北市", "西藏自治区那曲市双湖县", "西藏自治区那曲市色尼区", "西藏自治区昌都市边坝县",
	"西藏自治区昌都市丁青县", "西藏自治区昌都市洛隆县", "西藏自治区昌都市类乌齐县", "西藏自治区昌都市八宿县", "西藏自治区昌都市察雅县", "西藏自治区昌都市左贡县", "西藏自治区昌都市江达县",
	"西藏自治区昌都市贡觉县", "西藏自治区昌都市芒康县", "四川省宜宾市叙州区", "贵州省黔西南布依族苗族自治州兴仁市", "甘肃省平凉市华亭市", "贵州省铜仁市玉屏侗族自治县", "广西壮族自治区桂林市荔浦市",
	"山西省长治市屯留区", "山西省大同市云冈区", "山西省朔州市怀仁市", "湖北省荆门市京山市", "广东省佛山市南海区", "山西省长治市潞城区", "湖南省株洲市渌口区", "河南省郑州市二七区", "海南省三沙市中沙群岛",
	"香港香港元朗区", "香港香港离岛区", "香港香港大埔区", "香港香港南区", "香港香港西贡区", "山东省济南市济阳区", "山东省济南市莱芜区", "山东省滨州市邹平市", "河北省唐山市滦州市", "浙江省杭州市临安区",
	"福建省福州市长乐区", "台湾省台南市北门区", "台湾省台南市安南区", "山东省青岛市即墨区", "江苏省南通市海安市", "台湾省台南市柳营区", "台湾省高雄市阿莲区", "台湾省高雄市三民区", "台湾省台中市清水区",
	"台湾省台南市南化区", "台湾省高雄市美浓区", "台湾省台中市后里区", "台湾省台中市太平区", "台湾省高雄市那玛夏区", "台湾省高雄市桃源区", "台湾省台中市和平区", "台湾省桃园市中坜市",
	"黑龙江省大兴安岭地区漠河市", "台湾省新北市莺歌区", "台湾省桃园市复兴乡", "台湾省台北市士林区", "台湾省台北市文山区", "台湾省新北市乌来区", "台湾省新北市坪林区"
]
p: 33 33
c: 344 344
d: 2602 2602
error: 74
-----------------
p:33    33
c:344    344
d:2563    2563
error:67