//  中心点     108.320004,22.82402

const area = require("./gx.json");
//area_id
//


let data = [
    {
        "年份": 2019,
        "月份": 10,
        "月产量": 39.9,
        "月销量": 13.6
    },
    {
        "年份": 2019,
        "月份": 11,
        "月产量": 87.38,
        "月销量": 43.22
    },
    {
        "年份": 2019,
        "月份": 12,
        "月产量": 252.44,
        "月销量": 140.96
    },
    {
        "年份": 2020,
        "月份": 1,
        "月产量": 261.75,
        "月销量": 122.27
    },
    {
        "年份": 2020,
        "月份": 2,
        "月产量": 241.9,
        "月销量": 81.64
    },
    {
        "年份": 2020,
        "月份": 3,
        "月产量": 98.64,
        "月销量": 75.32
    },
    {
        "年份": 2020,
        "月份": 4,
        "月产量": 39.8,
        "月销量": 75.82
    },
    {
        "年份": 2020,
        "月份": 5,
        "月产量": 19.74,
        "月销量": 78.32
    },
    {
        "年份": 2020,
        "月份": 6,
        "月产量": 0.79,
        "月销量": 78.52
    },
    {
        "年份": 2020,
        "月份": 7,
        "月产量": 0,
        "月销量": 86.11
    },
    {
        "年份": 2020,
        "月份": 8,
        "月产量": 0,
        "月销量": 106.4
    },
    {
        "年份": 2020,
        "月份": 9,
        "月产量": 0,
        "月销量": 82.7
    }
]
/**
 *  {
    "x": "2010/01/01 00:00:00",
    "y": 300,
    "s": "1"
  },
  {
    "x": "2010/01/01 00:00:00",
    "y": 200,
    "s": "2"
  },
  {
    "x": "2010/02/01 00:00:00",
    "y": 200,
    "s": "1"
  },
  {
    "x": "2010/02/01 00:00:00",
    "y": 100,
    "s": "2"
  },
 * 
 * 
 */
let res = [];
 data.forEach(v=>{
    let date = new Date();
    console.log(date);
    date.setFullYear(v["年份"]);
    date.setMonth(v["月份"]);
    let time = date.toLocaleString();
    res.push({
        "x": v["年份"]+"/" +v["月份"],
        "y":v["月产量"],
        "s": 1
    })
    res.push({
        "x": v["年份"]+"/" +v["月份"],
        "y":v["月销量"],
        "s": 2
    })
})

console.log(JSON.stringify(res,null,4));