//  中心点     108.320004,22.82402

const area = require("./gx.json");
//area_id
//


let data = [
    {
        "市": "北海市",
        "种植面积/万亩": 45.9825,
        "种蔗户数": 43772,
        "人均收入": 5629.793552
    },
    {
        "市": "百色市",
        "种植面积/万亩": 76.16,
        "种蔗户数": 53766,
        "人均收入": 6707.875458
    },
    {
        "市": "崇左市",
        "种植面积/万亩": 396.46,
        "种蔗户数": 273282,
        "人均收入": 7108.404892
    },
    {
        "市": "防城港市",
        "种植面积/万亩": 45.67,
        "种蔗户数": 24639,
        "人均收入": 17995.78977
    },
    {
        "市": "贵港市",
        "种植面积/万亩": 31.73,
        "种蔗户数": 47036,
        "人均收入": 2436.871895
    },
    {
        "市": "桂林市",
        "种植面积/万亩": 0.4,
        "种蔗户数": 1800,
        "人均收入": 2166
    },
    {
        "市": "河池市",
        "种植面积/万亩": 68.3,
        "种蔗户数": 50845,
        "人均收入": 5397.55
    },
    {
        "市": "贺州市",
        "种植面积/万亩": 0.29,
        "种蔗户数": 16,
        "人均收入": 55950
    },
    {
        "市": "来宾市",
        "种植面积/万亩": 172.45,
        "种蔗户数": 191016,
        "人均收入": 6277.22
    },
    {
        "市": "柳州市",
        "种植面积/万亩": 105.51,
        "种蔗户数": 85372,
        "人均收入": 7790.81
    },
    {
        "市": "南宁市",
        "种植面积/万亩": 175.73,
        "种蔗户数": 205382,
        "人均收入": 5605.84
    },
    {
        "市": "钦州市",
        "种植面积/万亩": 36.57,
        "种蔗户数": 26950,
        "人均收入": 4852.65
    },
    {
        "市": "梧州市",
        "种植面积/万亩": 0,
        "种蔗户数": 0,
        "人均收入": 0
    },
    {
        "市": "玉林市",
        "种植面积/万亩": 1.24,
        "种蔗户数": 312,
        "人均收入": 13520.7
    }
]

/**
 * 
 *  {
    "area_id": "820000",
    "value": 407
  }
 * 
 * JSON.stringify(item)
 */
let res = area.features.map(v=>{
    let item = data.filter(item=>item["市"] ==v.properties.name)[0];
    return {
        "lng":v.properties.center[0],
        "lat":v.properties.center[1],
        info:`
        <div style='font-width:600'>${item['市']}</div>
        <div><span style='display:inline-block;width:100px;'>种植面积:</span>${item['种植面积/万亩']}万亩</div>
        <div><span style='display:inline-block;width:100px;'>种蔗户数:</span>${item['种蔗户数']}户</div>
        <div><span style='display:inline-block;width:100px;'>人均收入:</span>${item['人均收入'].toFixed(2)}万元</div>
        `
      }
})

console.log(JSON.stringify(res,null,4));